uhnp/src/Reports/ПлатежныйКалендарьУХ/ПлатежныйКалендарьУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПлатежныйКалендарьУХ</name>
  <comment>(-УХ)</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтбора</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяВерсияПлатежногоКалендаря</name>
    <type>
      <types>CatalogRef.СохраненныеВерсииПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОстаткиСУчетомОвердрафтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПоступленияПередСписаниями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СворачиватьНеуправляемыеСписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоПриоритетуПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСумме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СортироватьУправляемыеСписанияПоСуммеПоУбыванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоДнейОперативногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаОтображенияПросроченныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СценарийСтрессТестированияЛиквидности</name>
    <type>
      <types>CatalogRef.СценарииСтрессТестированияЛиквидности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДиаграмму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОбороты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтОперативногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаТаблицыОстатковИОборотов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМакетаОформления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОтбораПросроченныхЗаявок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПереводаМеждуСчетами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссииПриКонвертацииВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СущественнаяРазницаСтоимостиКредитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДанныеВВалютеОтображения</name>
    <comment>Выводить данные календаря в валюте отображения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкиОтчета</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтТактическогоПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОперативногоПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьТолькоКассовыеРазрывы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПлатежногоКалендаря</name>
    <type>
      <types>EnumRef.ВариантыПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВходящихОстатков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСобытияФормированияОтчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыводаОборотов</name>
    <type>
      <types>EnumRef.РежимыВыводаОборотовПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализаЭкстраполяцииДенежныхПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДолгосрочногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтДолгосрочногоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаДанныхДоговоров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДоверительныеКоэффициентыПриПланированииПоступлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБазоваяФункциональность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлановыеКурсы</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаВесовЛиквидности</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>EnumRef.ИсточникиДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоризонтПланированияЛиквидности</name>
      <type>
        <types>EnumRef.ГоризонтыПланированияЛиквидности</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>DefinedType.ВесИсточникаДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаВариантовОптимизации</name>
    <attributes>
      <name>ВариантОптимизации</name>
      <type>
        <types>EnumRef.ВариантыОптимизацииПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

uhnp/src/InformationRegisters/ВерсииГрафиковРасчетов/ВерсииГрафиковРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииГрафиковРасчетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОпорныйГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПредставлениеПлатежногоКалендаря/ПредставлениеПлатежногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредставлениеПлатежногоКалендаря</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторОтменившейОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайняяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированныйБанковскийСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>EnumRef.ИсточникиДанныхПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>Оптимизация</name>
    <comment>Операция добавлена в ходе оптимизации календаря</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияПлатежногоКалендаря</name>
    <type>
      <types>CatalogRef.СохраненныеВерсииПлатежногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПулЛиквидности</name>
    <type>
      <types>CatalogRef.ПулыЛиквидности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>DefinedType.Банк</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>DefinedType.БанковскийСчетКасса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделПлатежногоКалендаря</name>
    <type>
      <types>EnumRef.РазделыПлатежногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструмент</name>
    <type>
      <types>DefinedType.ИнструментыПлатежногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторДобавившейОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДенежныхСредств</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СвязьКонтрагентовИБанков/СвязьКонтрагентовИБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьКонтрагентовИБанков</name>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>DefinedType.Банк</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыДатВалютирования/ВидыДатВалютирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДатВалютирования</name>
  <enumValues>
    <name>TOD</name>
  </enumValues>
  <enumValues>
    <name>TOM</name>
  </enumValues>
  <enumValues>
    <name>SPT</name>
  </enumValues>
  <enumValues>
    <name>FWD</name>
    <comment>Сделка осуществляется по форвардному курсу</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ФормыОплаты/ФормыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФормыОплаты</name>
  <enumValues>
    <name>Наличная</name>
  </enumValues>
  <enumValues>
    <name>Безналичная</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>БонусныеБаллы</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ГоризонтыПланированияЛиквидности/ГоризонтыПланированияЛиквидности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГоризонтыПланированияЛиквидности</name>
  <enumValues>
    <name>ОперативноеПланирование</name>
  </enumValues>
  <enumValues>
    <name>ТактическоеПланирование</name>
  </enumValues>
  <enumValues>
    <name>ПерспективноеПланирование</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыОперацийПлатежногоКалендаря/ВидыОперацийПлатежногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПлатежногоКалендаря</name>
  <enumValues>
    <name>РазделениеОперации</name>
  </enumValues>
  <enumValues>
    <name>ПереводСобственныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ВнутригрупповоеПеремещение</name>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
  </enumValues>
  <enumValues>
    <name>ПривлечениеФинансирования</name>
  </enumValues>
  <enumValues>
    <name>РазмещениеСредств</name>
  </enumValues>
  <enumValues>
    <name>ПомещениеВСтопЛист</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзСтопЛиста</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>Овердрафт</name>
  </enumValues>
  <enumValues>
    <name>НовыйДоговорКредита</name>
  </enumValues>
  <enumValues>
    <name>НовыйДоговорДепозита</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеКредита</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Reports/ПлатежныйКалендарьУХ/Forms/ФормаПереводаКонверсии/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("РедактированиеТекущейОперации") Тогда
		
		РедактированиеТекущейОперации = Истина;
		ДанныеТекущейОперации = Параметры.ДанныеТекущейОперации;
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеТекущейОперации);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеТекущейОперации.УточнениеОперации);
		УстановитьВидДенежныхСредствРедактируемойОперации();
		ИменаРеквизитов = ПолучитьИменаРеквизитов(ЭтоКонвертацияВалюты, ЭтоПополнениеСчетаКассы, ЭтоВнутригрупповоеПеремещение);
		ДатаОперации = ЭтаФорма[ИменаРеквизитов.ДатаВедущая];
		БанковскийСчетКасса = ЭтаФорма[ИменаРеквизитов.БанковскийСчетКассаВедущий];
		
		ЭтаФорма[ИменаРеквизитов.НачальныйОстатокВедущий] = ОстатокПоСчетуНаДату(ЭтаФорма[ИменаРеквизитов.БанковскийСчетКассаВедущий], ЭтаФорма[ИменаРеквизитов.ДатаВедущая]);
		ЭтаФорма[ИменаРеквизитов.НачальныйОстатокВедомый] = ОстатокПоСчетуНаДату(ЭтаФорма[ИменаРеквизитов.БанковскийСчетКассаВедомый], ЭтаФорма[ИменаРеквизитов.ДатаВедомая]);
		ПересчитатьОстаткиНаСчетахОперации(ЭтаФорма);
		
	Иначе	
		ДанныеЗаполненияСтруктура = Параметры.ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеЗаполненияСтруктура);
		
		ИменаРеквизитов = ПолучитьИменаРеквизитов(ЭтоКонвертацияВалюты, ЭтоПополнениеСчетаКассы, ЭтоВнутригрупповоеПеремещение);
		
		ЭтаФорма[ИменаРеквизитов.БанковскийСчетКассаВедущий] = БанковскийСчетКасса;
		ЭтаФорма[ИменаРеквизитов.ДатаВедущая] = ДатаОперации;
		ЭтаФорма[ИменаРеквизитов.ДатаВедомая] = ДатаОперации;
		ЭтаФорма[ИменаРеквизитов.ВалютаВедущая] = БанковскийСчетКасса.ВалютаДенежныхСредств;
		ЭтаФорма[ИменаРеквизитов.СуммаВедущая] = ?(КонечныйОстаток < 0, - КонечныйОстаток, КонечныйОстаток);
		ЭтаФорма[ИменаРеквизитов.НачальныйОстатокВедущий] = КонечныйОстаток;
		
		Если НЕ ЭтоКонвертацияВалюты Тогда
			ЭтаФорма[ИменаРеквизитов.ВалютаВедомая] = БанковскийСчетКасса.ВалютаДенежныхСредств;
			ЭтаФорма[ИменаРеквизитов.СуммаВедомая] = ЭтаФорма[ИменаРеквизитов.СуммаВедущая];
			ЭтаФорма[ИменаРеквизитов.НачальныйОстатокВедомый] = КонечныйОстаток;
		КонецЕсли;
		
		ЭтаФорма[ИменаРеквизитов.ОрганизацияВедущая] = БанковскийСчетКасса.Владелец;
		
		Если НЕ ЭтоВнутригрупповоеПеремещение Тогда
			ЭтаФорма[ИменаРеквизитов.ОрганизацияВедомая] = БанковскийСчетКасса.Владелец;
		КонецЕсли;
		
		Если ЭтоКонвертацияВалюты Тогда
			КратностьКонвертации = 1;
			ВидДатыВалютирования = Перечисления.ВидыДатВалютирования.TOD;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоВнутригрупповоеПеремещение Тогда
		
		Запрос = Новый Запрос;
		
		Если ЭтоПополнениеСчетаКассы Тогда
			// Контрагент известен.
			КонтрагентВГО = РаботаСКонтрагентамиУХ.КонтрагентОрганизации(БанковскийСчетКасса.Владелец);
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ДоговорыКонтрагентов.Организация КАК Организация
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.Контрагент = &КонтрагентВГО
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДоговорыКредитовИДепозитов.Организация
			|ИЗ
			|	Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
			|ГДЕ
			|	ДоговорыКредитовИДепозитов.Контрагент = &КонтрагентВГО
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДоговорыАренды.Организация
			|ИЗ
			|	Справочник.ДоговорыАренды КАК ДоговорыАренды
			|ГДЕ
			|	ДоговорыАренды.Контрагент = &КонтрагентВГО";

			Запрос.УстановитьПараметр("КонтрагентВГО", КонтрагентВГО);
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ДоговорыКонтрагентов.Контрагент.ОрганизационнаяЕдиница КАК Организация
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.Организация = &Организация
			|	И ДоговорыКонтрагентов.Контрагент.ОрганизационнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДоговорыКредитовИДепозитов.Контрагент.ОрганизационнаяЕдиница
			|ИЗ
			|	Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
			|ГДЕ
			|	ДоговорыКредитовИДепозитов.Организация = &Организация
			|	И ДоговорыКредитовИДепозитов.Контрагент.ОрганизационнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДоговорыАренды.Контрагент.ОрганизационнаяЕдиница
			|ИЗ
			|	Справочник.ДоговорыАренды КАК ДоговорыАренды
			|ГДЕ
			|	ДоговорыАренды.Организация = &Организация
			|	И ДоговорыАренды.Контрагент.ОрганизационнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
			Запрос.УстановитьПараметр("Организация", БанковскийСчетКасса.Владелец);
		КонецЕсли;
		
		СписокОрганизацийДляВГО.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));
	КонецЕсли;
	
	ЗаполнитьМатрицуВесовЛиквидности();
	
	УстановитьВариантСписанияЗачисления(ВидДенежныхСредств);
	
	ПодготовитьФормуНаСервере();
	
	ЗаполнитьДоступныеСчетаКассы();
	ЗаполнитьАналитикиБюджетирования();
	СоздатьАналитикиСтатейБюджета(); 
	ЗаполнитьОтдельныйСчетГОЗ();
	УправлениеЭлементамиФормы();
	
	УстановитьУсловноеОформление();	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НЕ ЭтоВнутригрупповоеПеремещение Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");
	КонецЕсли;
	
	Если НЕ ЭтоКонвертацияВалюты И НЕ ЭтоВнутригрупповоеПеремещение Тогда
		// просто перевод
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("БанковскийСчетКонтрагента");
		
	ИначеЕсли ЭтоКонвертацияВалюты И НЕ ЭтоВнутригрупповоеПеремещение Тогда
		// Это конвертация
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");
	ИначеЕсли НЕ ЭтоКонвертацияВалюты И ЭтоВнутригрупповоеПеремещение Тогда
		// это внутригрупповое перемещение
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("БанковскийСчетКонтрагента");
	КонецЕсли;
	
	Если ДатаСписания < ДатаНачалаПланирования Тогда
		ШаблонТекстаОшибки = НСтр("ru = 'Дата списания не должна быть раньше даты начала планирования %1'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(ШаблонТекстаОшибки, Формат(ДатаНачалаПланирования, "ДЛФ=D")),
			,
			"ДатаСписания",
			,
			Отказ);
	КонецЕсли;
	
	Если ДатаЗачисления < ДатаНачалаПланирования Тогда
		ШаблонТекстаОшибки = НСтр("ru = 'Дата зачисления не должна быть раньше даты начала планирования %1'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(ШаблонТекстаОшибки, Формат(ДатаНачалаПланирования, "ДЛФ=D")),
			,
			"ДатаЗачисления",
			,
			Отказ);
	КонецЕсли;
	
	Если НЕ ОтдельныйСчетГОЗ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТипПлатежаФЗ275");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если РедактированиеТекущейОперации Тогда
		ПересчетОстатковПослеОперации();
	КонецЕсли;	
	
	УстановитьСтраницыПомощника("СтраницаОсновное");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СуммаЗачисленияПриИзменении(Элемент)
	
	Если ЭтоКонвертацияВалюты Тогда
		
		Если ЭтоПополнениеСчетаКассы Тогда
			Если КурсКонвертации <> 0 И КратностьКонвертации <> 0 Тогда
				СуммаСписания = СуммаЗачисления * КурсКонвертации / КратностьКонвертации;
			Иначе
				СуммаСписания = 0;
			КонецЕсли;
		Иначе
			Если СуммаСписания <> 0 Тогда
				КратностьКонвертации = 1;
				КурсКонвертации = СуммаСписания / СуммаЗачисления;
			Иначе
				КурсКонвертации = 0;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		СуммаСписания = СуммаЗачисления;
		
	КонецЕсли;
	
	ПересчетОстатковПослеОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСписанияПриИзменении(Элемент)
	
	Если ЭтоКонвертацияВалюты Тогда
		
		Если ЭтоПополнениеСчетаКассы Тогда
			Если СуммаСписания <> 0 Тогда
				КратностьКонвертации = 1;
				КурсКонвертации = СуммаСписания / СуммаЗачисления;
			Иначе
				КурсКонвертации = 0;
			КонецЕсли;
			
		Иначе
			Если КратностьКонвертации <> 0 И КурсКонвертации <> 0 Тогда
				СуммаЗачисления = СуммаСписания * КратностьКонвертации / КурсКонвертации;
			Иначе
				СуммаЗачисления = 0;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		СуммаЗачисления = СуммаСписания;
		
	КонецЕсли;
	
	ПересчетОстатковПослеОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДатыВалютированияПриИзменении(Элемент)
	
	ПересчетОстатковПослеОперации();

КонецПроцедуры

&НаКлиенте
Процедура КратностьКонвертацииПриИзменении(Элемент)
	
	ПриИзмененииКурсаКратности();

КонецПроцедуры

&НаКлиенте
Процедура КурсКонвертацииПриИзменении(Элемент)
	
	ПриИзмененииКурсаКратности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСписанияПриИзменении(Элемент)
	
	Если Не ЭтоКонвертацияВалюты Тогда

		ДатаЗачисления = ДатаСписания;
		
	КонецЕсли;
	
	ПересчетОстатковПослеОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтатьяБюджета_ПриИзменении(Элемент)
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтатьиБюджета_ПриИзменении(Элемент)
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииАналитикиСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗачисленияПриИзменении(Элемент)
	
	ПриИзмененииВариантаСписанияЗачисленияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСписанияПриИзменении(Элемент)
	
	ПриИзмененииВариантаСписанияЗачисленияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	
	ДоговорКонтрагентаПриИзмененииНаСервере();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДоступныеСредства
&НаКлиенте
Процедура ДоступныеСредстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭтоОперацияСоСчетом = ЭтоОперацияСоСчетом(ЭтоПополнениеСчетаКассы,ВариантСписания,ВариантЗачисления);
	
	ТекДанные = Элементы.ДоступныеСредства.ТекущиеДанные;
	ВыполнитьВыбор = Ложь;
	Если ТекДанные <> Неопределено Тогда
		Если ЭтоОперацияСоСчетом Тогда
			Если  ТипЗнч(ТекДанные.Измерение) = ДенежныеСредстваВстраиваниеУХКлиентСервер.ТипБанковскиеСчетаОрганизаций() Тогда
				ВыполнитьВыбор = Истина;
			КонецЕсли;
		ИначеЕсли  ЗначениеЗаполнено(ТекДанные.Измерение) Тогда
			ВыполнитьВыбор = Истина;
		КонецЕсли;
	КонецЕсли;

	Если ВыполнитьВыбор Тогда
		ОбновитьВедомыеРеквизитыНаСервере(Элементы.ДоступныеСредства.ТекущаяСтрока);
		ПересчетОстатковПослеОперации();  
		УправлениеКнопкамиПомощника(Элементы.Помощник.ТекущаяСтраница.Имя);     	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	Результат = КомандаОКНаСервере();
	Если ЗначениеЗаполнено(Результат) Тогда
		Закрыть(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыСтраницы = ПараметрыСтраницы(Элементы.Помощник.ТекущаяСтраница.Имя);
	Если ПараметрыСтраницы.Предыдущие.Количество() > 0  Тогда
		УстановитьСтраницыПомощника(ПараметрыСтраницы.Предыдущие[ПараметрыСтраницы.Предыдущие.Количество()-1]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ЗаполненыПараметрыШага() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтраницы = ПараметрыСтраницы(Элементы.Помощник.ТекущаяСтраница.Имя);
	
	Если ПараметрыСтраницы.Текущая = "СтраницаОсновное" Тогда
		ЗаполнитьАналитикиБюджетирования();	
	КонецЕсли;
	
	Если ПараметрыСтраницы.Следующие.Количество() > 0  Тогда
		УстановитьСтраницыПомощника(ПараметрыСтраницы.Следующие[0]);
	КонецЕсли;
	
	Если ЭтоКонвертацияВалюты Тогда
		ВыполнитьПроверкуРанееВведенныхРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьМатрицуВесовЛиквидности()
	
	Если Параметры.ДанныеЗаполнения.Свойство("АдресМатрицыВесовЛиквидности") Тогда 
		ТаблицаМатрицаВесовЛиквидности = ПолучитьИзВременногоХранилища(Параметры.ДанныеЗаполнения.АдресМатрицыВесовЛиквидности);
		ДенежныеСредстваВстраиваниеУХ.ДополнитьМатрицуВесовЛиквидности(ТаблицаМатрицаВесовЛиквидности);
		МатрицаВесовЛиквидности.Загрузить(ТаблицаМатрицаВесовЛиквидности);
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Процедура УстановитьВидДенежныхСредствРедактируемойОперации()

	Если ЭтоПополнениеСчетаКассы Тогда
		ИмяРеквизита = "БанковскийСчетКассаЗачисления";
	Иначе
		ИмяРеквизита = "БанковскийСчетКассаСписания";
	КонецЕсли;
	
	ЗначениеРеквизита = ЭтаФорма[ИмяРеквизита];
	
	Если ТипЗнч(ЗначениеРеквизита) = Тип("СправочникСсылка.Кассы") Тогда
		ВидДенежныхСредств = Перечисления.ФормыОплаты.Наличная;	
	Иначе
		ВидДенежныхСредств = Перечисления.ФормыОплаты.Безналичная;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПараметрыСтраницы(ИмяСтраницы)
	
	Результат = Новый Структура("Текущая, Предыдущие, Следующие");
	Результат.Вставить("Предыдущие", Новый Массив);
	Результат.Вставить("Следующие", Новый Массив);
	Результат.Вставить("ДоступностьОК", Новый Соответствие);
	
	//
	МассивСтраниц = Новый Массив;
	МассивСтраниц.Добавить("СтраницаОсновное");
	МассивСтраниц.Добавить("СтраницаДопПараметры");
	
	ИндексТекущейСтраницы = МассивСтраниц.Найти(ИмяСтраницы);
	Если ИндексТекущейСтраницы = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка управления страницами'");
	КонецЕсли;
	
	Поз = 0; 
	ДоступностьОК = Истина;
	Пока Поз < МассивСтраниц.Количество() Цикл
		Имя = МассивСтраниц[Поз];
		Если Поз = ИндексТекущейСтраницы Тогда
			Результат.Текущая = Имя;
			ДоступностьОК = ДоступностьОК И СтраницаЗаполнена(Имя);
		ИначеЕсли Поз < ИндексТекущейСтраницы Тогда
			Если СтраницаТребуется(Имя) Тогда
				Результат.Предыдущие.Добавить(Имя);
				ДоступностьОК = ДоступностьОК И СтраницаЗаполнена(Имя);
			КонецЕсли;
		ИначеЕсли Поз > ИндексТекущейСтраницы Тогда
			Если СтраницаТребуется(Имя) Тогда
				Результат.Следующие.Добавить(Имя);
				ДоступностьОК = ДоступностьОК И СтраницаЗаполнена(Имя);
			КонецЕсли;
		КонецЕсли;
		Поз = Поз + 1;
	КонецЦикла;
	Результат.ДоступностьОК = ДоступностьОК;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтраницаТребуется(ИмяСтраницы)
	
	Результат = Ложь;
	
	Если ИмяСтраницы = Элементы.СтраницаОсновное.Имя Тогда
		Результат = Результат ИЛИ Истина;
	ИначеЕсли ИмяСтраницы = Элементы.СтраницаДопПараметры.Имя Тогда   
		Результат = Результат ИЛИ ЭтоКонвертацияВалюты;
		Результат = Результат ИЛИ ЭтоВнутригрупповоеПеремещение;
		Результат = Результат ИЛИ Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтраницаЗаполнена(ИмяСтраницы)
	
	Результат = Истина;
	
	Если ИмяСтраницы = Элементы.СтраницаОсновное.Имя Тогда
		Результат = ЗначениеЗаполнено(СуммаСписания) И ЗначениеЗаполнено(СуммаЗачисления) И ЗначениеЗаполнено(БанковскийСчетКассаСписания);
	ИначеЕсли ИмяСтраницы = Элементы.СтраницаДопПараметры.Имя Тогда
		Если ЭтоКонвертацияВалюты Тогда
			Результат = Результат И ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(БанковскийСчетКонтрагента);
		КонецЕсли;
		Если ЭтоВнутригрупповоеПеремещение Тогда
			Результат = Результат И ЗначениеЗаполнено(ДоговорКонтрагента);
		КонецЕсли;
		Результат = Результат И ЗаполненыВсеАналитикиБюджетирования();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаполненыВсеАналитикиБюджетирования()
	
	Результат = ЗначениеЗаполнено(ЦФО) 
		И ЗначениеЗаполнено(Подразделение) 
		И ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) 
		И ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредствЗачисление);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаполненыПараметрыШага()
	
	Результат = Истина;
	
	Если Элементы.Помощник.ТекущаяСтраница = Элементы.СтраницаОсновное Тогда
		
		Результат = РеквизитЗаполнен("СуммаСписания", "", НСтр("ru = 'Сумма (списать)'")) И Результат;
		Результат = РеквизитЗаполнен("БанковскийСчетКассаСписания", "", НСтр("ru = 'Банковский счет / касса (списать)'")) И Результат;
		Результат = РеквизитЗаполнен("БанковскийСчетКассаЗачисления", "", НСтр("ru = 'Банковский счет / касса (зачислить)'")) И Результат;
		
	ИначеЕсли Элементы.Помощник.ТекущаяСтраница = Элементы.СтраницаДопПараметры Тогда
		
		Если ЭтоКонвертацияВалюты Тогда
			Результат = РеквизитЗаполнен("Контрагент", "", НСтр("ru = 'Контрагент (банк, исполняющий конвертацию)'")) И Результат;
			Результат = РеквизитЗаполнен("БанковскийСчетКонтрагента", "", НСтр("ru = 'Банковский счет банка, проводящего конвертацию'")) И Результат;
		КонецЕсли;  
		
		Если ЭтоВнутригрупповоеПеремещение Тогда
			Результат = РеквизитЗаполнен("ДоговорКонтрагента", "", НСтр("ru = 'Договор контрагента'")) И Результат;
		КонецЕсли;
		
		Результат = РеквизитЗаполнен("ЦФО", "", НСтр("ru = 'ЦФО'")) И Результат ;
		Результат = РеквизитЗаполнен("Подразделение", "", НСтр("ru = 'Подразделение'")) И Результат ;
		Результат = РеквизитЗаполнен("СтатьяДвиженияДенежныхСредств", "", НСтр("ru = 'Статья (списание)'")) И Результат;
		Результат = РеквизитЗаполнен("СтатьяДвиженияДенежныхСредствЗачисление", "", НСтр("ru = 'Статья (зачисление)'")) И Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РеквизитЗаполнен(ИмяРеквизита, ПутьКДанным = "", Представление)
	
	Отказ = Ложь;
	Если ПутьКДанным = "" Тогда
		Контейнер = ЭтаФорма;
	Иначе
		Контейнер = ЭтаФорма[ПутьКДанным];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Контейнер[ИмяРеквизита]) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",	"Заполнение", Представление);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ИмяРеквизита, ПутьКДанным, Отказ);
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоОперацияСоСчетом(ЭтоПополнениеСчетаКассы,ВариантСписания,ВариантЗачисления)

	Если ЭтоПополнениеСчетаКассы Тогда
		ЭтоОперацияСоСчетом = (ВариантСписания = "СоСчета");
	Иначе
		ЭтоОперацияСоСчетом = (ВариантЗачисления = "НаСчет");
	КонецЕсли;

	Возврат ЭтоОперацияСоСчетом;
	
КонецФункции 

&НаСервере
Процедура ПриИзмененииВариантаСписанияЗачисленияНаСервере()

	УстановитьСвойстваЭлементовФормыПоВариантуСписанияЗачисления();
	ОчиститьБанковскийСчетКассуСписанияЗачисления();
	ЗаполнитьДоступныеСчетаКассы();
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьВариантСписанияЗачисления(ВидДенежныхСредств)
		
	Если ВидДенежныхСредств = Перечисления.ФормыОплаты.Наличная Тогда
		
		ВариантСписания = "ИзКассы";
		ВариантЗачисления = "ВКассу";
	
	ИначеЕсли ВидДенежныхСредств = Перечисления.ФормыОплаты.Безналичная Тогда
		
		ВариантСписания = "СоСчета";
		ВариантЗачисления = "НаСчет";

	КонецЕсли;
	
	УстановитьСвойстваЭлементовФормыПоВариантуСписанияЗачисления();

КонецПроцедуры 

&НаСервере
Процедура УстановитьСвойстваЭлементовФормыПоВариантуСписанияЗачисления()

	ЭтоОперацияСоСчетом = ЭтоОперацияСоСчетом(ЭтоПополнениеСчетаКассы,ВариантСписания,ВариантЗачисления);
	
	СкрытьВариантыСписанияЗачисления = ЭтоВнутригрупповоеПеремещение ИЛИ ЭтоКонвертацияВалюты;
	
	СоответствиеСвойствЭлементов = Новый Соответствие;
	
	СвойстваЭлементаБанковскийСчетКассаСписания = Новый Структура;
	СвойстваЭлементаБанковскийСчетКассаЗачисления = Новый Структура;
	СвойстваЭлементаГруппаСчетаКорреспонденты = Новый Структура;
	СвойстваЭлементаОрганизацияСписания = Новый Структура;
	СвойстваЭлементаОрганизацияЗачисления = Новый Структура;
	СвойстваЭлементаВариантЗачисления = Новый Структура;
	СвойстваЭлементаВариантСписания = Новый Структура;
	
	Если ВариантСписания = "ИзКассы" Тогда
		
		СвойстваЭлементаБанковскийСчетКассаСписания.Вставить("Заголовок",НСтр("ru = 'касса'"));
		СвойстваЭлементаБанковскийСчетКассаСписания.Вставить("ПодсказкаВвода",НСтр("ru = '<выберите кассу из списка ниже>'"));
		СвойстваЭлементаОрганизацияСписания.Вставить("ПодсказкаВвода",НСтр("ru = '<касса не выбрана>'"));
		
	ИначеЕсли ВариантСписания = "СоСчета" Тогда
		
		СвойстваЭлементаБанковскийСчетКассаСписания.Вставить("Заголовок",НСтр("ru = 'счет'"));
		СвойстваЭлементаБанковскийСчетКассаСписания.Вставить("ПодсказкаВвода",НСтр("ru = '<выберите счет из списка ниже>'"));
		СвойстваЭлементаОрганизацияСписания.Вставить("ПодсказкаВвода",НСтр("ru = '<банковский счет не выбран>'"));
		
	КонецЕсли;
	
	Если ВариантЗачисления = "ВКассу" Тогда
		
		СвойстваЭлементаБанковскийСчетКассаЗачисления.Вставить("Заголовок",НСтр("ru = 'касса'"));
		СвойстваЭлементаБанковскийСчетКассаЗачисления.Вставить("ПодсказкаВвода",НСтр("ru = '<выберите кассу из списка ниже>'"));
		СвойстваЭлементаОрганизацияЗачисления.Вставить("ПодсказкаВвода",НСтр("ru = '<касса не выбрана>'"));
		
	ИначеЕсли ВариантЗачисления = "НаСчет" Тогда
		
		СвойстваЭлементаБанковскийСчетКассаЗачисления.Вставить("Заголовок",НСтр("ru = 'счет'"));
		СвойстваЭлементаБанковскийСчетКассаЗачисления.Вставить("ПодсказкаВвода",НСтр("ru = '<выберите счет из списка ниже>'"));
		СвойстваЭлементаОрганизацияЗачисления.Вставить("ПодсказкаВвода",НСтр("ru = '<банковский счет не выбран>'"));

	КонецЕсли;
	
	Если ЭтоОперацияСоСчетом Тогда
		СвойстваЭлементаГруппаСчетаКорреспонденты.Вставить("Заголовок",НСтр("ru = 'Доступные средства (выбор счета)'"));
	Иначе
		СвойстваЭлементаГруппаСчетаКорреспонденты.Вставить("Заголовок",НСтр("ru = 'Доступные средства (выбор кассы)'"));
	КонецЕсли;
	
	СвойстваЭлементаВариантЗачисления.Вставить("ТолькоПросмотр",ЭтоПополнениеСчетаКассы);
	СвойстваЭлементаВариантЗачисления.Вставить("Видимость",Не СкрытьВариантыСписанияЗачисления);
	СвойстваЭлементаВариантСписания.Вставить("ТолькоПросмотр",Не ЭтоПополнениеСчетаКассы);
	СвойстваЭлементаВариантСписания.Вставить("Видимость",Не СкрытьВариантыСписанияЗачисления);
	
	СоответствиеСвойствЭлементов.Вставить("БанковскийСчетКассаСписания",СвойстваЭлементаБанковскийСчетКассаСписания);
	СоответствиеСвойствЭлементов.Вставить("БанковскийСчетКассаЗачисления",СвойстваЭлементаБанковскийСчетКассаЗачисления);
	СоответствиеСвойствЭлементов.Вставить("ГруппаСчетаКорреспонденты",СвойстваЭлементаГруппаСчетаКорреспонденты);
	СоответствиеСвойствЭлементов.Вставить("ВариантЗачисления",СвойстваЭлементаВариантЗачисления);
	СоответствиеСвойствЭлементов.Вставить("ВариантСписания",СвойстваЭлементаВариантСписания);
	
	Для Каждого КлючЗначение Из СоответствиеСвойствЭлементов Цикл
		
		ЗаполнитьЗначенияСвойств(Элементы[КлючЗначение.Ключ],СоответствиеСвойствЭлементов.Получить(КлючЗначение.Ключ));
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьБанковскийСчетКассуСписанияЗачисления()

	ЭтаФорма[ИменаРеквизитов.БанковскийСчетКассаВедомый] = Неопределено;
	
КонецПроцедуры 

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Если ЭтоВнутригрупповоеПеремещение Тогда
		
		СтрВидОперации = НСтр("ru = 'Внутригрупповое перемещение'");
		
	ИначеЕсли ЭтоКонвертацияВалюты Тогда
		
		Если ЭтоПополнениеСчетаКассы Тогда
			
			СтрВидОперации = НСтр("ru = 'Покупка валюты'");
			
		Иначе
			
			СтрВидОперации = НСтр("ru = 'Продажа валюты'");
			
		КонецЕсли;
		
	Иначе
		
		СтрВидОперации = НСтр("ru = 'Перевод собственных средств'");
		
	КонецЕсли;
	
	Заголовок = Строка(БанковскийСчетКасса.Владелец) + ": " + СтрВидОперации;
	
	Элементы.ОрганизацияЗачисления.Видимость	= ЭтоВнутригрупповоеПеремещение;
	Элементы.ОрганизацияСписания.Видимость		= ЭтоВнутригрупповоеПеремещение;
	Элементы.ГруппаДоговор.Видимость			= ЭтоВнутригрупповоеПеремещение;
	
	Элементы.ГруппаСуммаВалютаЗачисления.Видимость	= ЭтоКонвертацияВалюты;
	Элементы.ГруппаКурс.Видимость					= ЭтоКонвертацияВалюты;
	
	Элементы[ИменаРеквизитов.БанковскийСчетКассаВедомый].ЦветФона = ЦветаСтиля.ФонУправляющегоПоля;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеСчетаКассы()
	
	ЭтоОперацияСоСчетом = ЭтоОперацияСоСчетом(ЭтоПополнениеСчетаКассы,ВариантСписания,ВариантЗачисления);
	
	Запрос = Новый Запрос;
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	МатрицаВесовЛиквидности.Источник КАК Источник,
	|	МатрицаВесовЛиквидности.ПриходРасход КАК ПриходРасход,
	|	МатрицаВесовЛиквидности.ГоризонтПланированияЛиквидности КАК ГоризонтПланированияЛиквидности,
	|	МатрицаВесовЛиквидности.Вес КАК Вес
	|ПОМЕСТИТЬ ВТ_МатрицаВесовЛиквидности
	|ИЗ
	|	&МатрицаВесовЛиквидности КАК МатрицаВесовЛиквидности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВерсииРасчетовСрезПоследних.ПредметГрафика КАК ПредметГрафика,
	|	ВерсииРасчетовСрезПоследних.Организация КАК Организация,
	|	ВерсииРасчетовСрезПоследних.ПредметГрафика.ДатаНачалаДействия КАК ДатаНачала,
	|	ВерсииРасчетовСрезПоследних.ПредметГрафика.ДатаОкончанияДействия КАК СрокДействия,
	|	ВерсииРасчетовСрезПоследних.ПредметГрафика.Сумма КАК Стоимость,
	|	ВерсииРасчетовСрезПоследних.ПредметГрафика.БанковскийСчет КАК СчетОрганизации,
	|	ВерсииРасчетовСрезПоследних.ПредметГрафика.ВидДоговораУХ = ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.Овердрафт) КАК ЭтоОвердрафт,
	|	ВерсииРасчетовСрезПоследних.ПредметГрафика.ВидДоговораУХ = ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.МинимальныйНеснижаемыйОстаток) КАК ЭтоМНО
	|ПОМЕСТИТЬ ВТ_ОвердрафтыИМНО
	|ИЗ
	|	РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних КАК ВерсииРасчетовСрезПоследних
	|ГДЕ
	|	ВерсииРасчетовСрезПоследних.ПредметГрафика.ВидДоговораУХ В (ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.Овердрафт), ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.МинимальныйНеснижаемыйОстаток))
	|	И ВерсииРасчетовСрезПоследних.ПредметГрафика ССЫЛКА Справочник.ДоговорыКредитовИДепозитов
	|	И ВерсииРасчетовСрезПоследних.ПредметГрафика.БанковскийСчет <> &ПустойБанковскийСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ПредставлениеПлатежногоКалендаря.Организация КАК Организация,
	|	ПредставлениеПлатежногоКалендаря.Валюта КАК Валюта,
	|	ПредставлениеПлатежногоКалендаря.Банк КАК Банк,
	|	ПредставлениеПлатежногоКалендаря.Сумма * ЕСТЬNULL(ВТ_МатрицаВесовЛиквидности.Вес, 0) КАК Остаток,
	|	ПредставлениеПлатежногоКалендаря.Сумма * ЕСТЬNULL(ВТ_МатрицаВесовЛиквидности.Вес, 0) КАК ОстатокПослеОперации,
	|	ИСТИНА КАК ЭтоДетальнаяЗапись
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрСведений.ПредставлениеПлатежногоКалендаря КАК ПредставлениеПлатежногоКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатрицаВесовЛиквидности КАК ВТ_МатрицаВесовЛиквидности
	|		ПО ПредставлениеПлатежногоКалендаря.ИсточникДанных = ВТ_МатрицаВесовЛиквидности.Источник
	|			И (ВЫБОР
	|				КОГДА ПредставлениеПлатежногоКалендаря.Сумма > 0
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|			КОНЕЦ = ВТ_МатрицаВесовЛиквидности.ПриходРасход)
	|			И (ВЫБОР
	|				КОГДА ПредставлениеПлатежногоКалендаря.Дата > &ГоризонтТактическогоПланирования
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ГоризонтыПланированияЛиквидности.ПерспективноеПланирование)
	|				КОГДА ПредставлениеПлатежногоКалендаря.Дата > &ГоризонтОперативногоПланирования
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ГоризонтыПланированияЛиквидности.ТактическоеПланирование)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ГоризонтыПланированияЛиквидности.ОперативноеПланирование)
	|			КОНЕЦ = ВТ_МатрицаВесовЛиквидности.ГоризонтПланированияЛиквидности)
	|ГДЕ
	|	ПредставлениеПлатежногоКалендаря.ВерсияПлатежногоКалендаря = ЗНАЧЕНИЕ(Справочник.СохраненныеВерсииПлатежногоКалендаря.ПустаяСсылка)
	|	И ПредставлениеПлатежногоКалендаря.Пользователь = &Пользователь
	|	И ПредставлениеПлатежногоКалендаря.Активна
	|	И ПредставлениеПлатежногоКалендаря.Дата <= &Дата
	|	И ВЫБОР
	|			КОГДА ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса ССЫЛКА Справочник.БанковскиеСчетаОрганизаций
	|				ТОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса КАК Справочник.БанковскиеСчетаОрганизаций).Закрыт, ЛОЖЬ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЕСТЬNULL(ВТ_МатрицаВесовЛиквидности.Вес, 1) <> 0
	|	И &ДополнительныйОтбор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОвердрафтыИМНО.СчетОрганизации,
	|	ВТ_ОвердрафтыИМНО.Организация,
	|	ВТ_ОвердрафтыИМНО.СчетОрганизации.ВалютаДенежныхСредств,
	|	ВТ_ОвердрафтыИМНО.СчетОрганизации.Банк,
	|	ВЫБОР
	|		КОГДА &УчитыватьОвердрафты
	|				И ВТ_ОвердрафтыИМНО.ЭтоОвердрафт
	|			ТОГДА ВТ_ОвердрафтыИМНО.Стоимость
	|		КОГДА &УчитыватьОвердрафты
	|				И ВТ_ОвердрафтыИМНО.ЭтоМНО
	|			ТОГДА -ВТ_ОвердрафтыИМНО.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &УчитыватьОвердрафты
	|				И ВТ_ОвердрафтыИМНО.ЭтоОвердрафт
	|			ТОГДА ВТ_ОвердрафтыИМНО.Стоимость
	|		КОГДА &УчитыватьОвердрафты
	|				И ВТ_ОвердрафтыИМНО.ЭтоМНО
	|			ТОГДА -ВТ_ОвердрафтыИМНО.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ИСТИНА
	|ИЗ
	|	ВТ_ОвердрафтыИМНО КАК ВТ_ОвердрафтыИМНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОвердрафтыИМНО.СчетОрганизации,
	|	ВТ_ОвердрафтыИМНО.Организация,
	|	ВТ_ОвердрафтыИМНО.СчетОрганизации.ВалютаДенежныхСредств,
	|	ВТ_ОвердрафтыИМНО.СчетОрганизации.Банк,
	|	ВЫБОР
	|		КОГДА &УчитыватьОвердрафты
	|				И ВТ_ОвердрафтыИМНО.ЭтоМНО
	|			ТОГДА ВТ_ОвердрафтыИМНО.Стоимость
	|		КОГДА &УчитыватьОвердрафты
	|				И ВТ_ОвердрафтыИМНО.ЭтоОвердрафт
	|			ТОГДА -ВТ_ОвердрафтыИМНО.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &УчитыватьОвердрафты
	|				И ВТ_ОвердрафтыИМНО.ЭтоМНО
	|			ТОГДА ВТ_ОвердрафтыИМНО.Стоимость
	|		КОГДА &УчитыватьОвердрафты
	|				И ВТ_ОвердрафтыИМНО.ЭтоОвердрафт
	|			ТОГДА -ВТ_ОвердрафтыИМНО.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ИСТИНА
	|ИЗ
	|	ВТ_ОвердрафтыИМНО КАК ВТ_ОвердрафтыИМНО
	|ГДЕ
	|	&УчитыватьОвердрафты
	|	И ВТ_ОвердрафтыИМНО.СрокДействия <= &ОкончаниеПериодаОтбора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.БанковскийСчетКасса КАК Измерение,
	|	СУММА(ВТ_Остатки.Остаток) КАК Остаток,
	|	СУММА(ВТ_Остатки.ОстатокПослеОперации) КАК ОстатокПослеОперации,
	|	ВТ_Остатки.ЭтоДетальнаяЗапись КАК ЭтоДетальнаяЗапись
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.Организация,
	|	ВТ_Остатки.Валюта,
	|	ВТ_Остатки.Банк,
	|	ВТ_Остатки.БанковскийСчетКасса,
	|	ВТ_Остатки.ЭтоДетальнаяЗапись
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остаток УБЫВ";
	
	Если ЭтоОперацияСоСчетом Тогда
		Запрос.Текст = Запрос.Текст+"
		|ИТОГИ
		|	&ФормулаИзмерение КАК Измерение,
		|	СУММА(Остаток),
		|	СУММА(ОстатокПослеОперации),
		|	ЛОЖЬ КАК ЭтоДетальнаяЗапись
		|ПО
		|	&ДополнительноТекстИтоги,
		|	ВТ_Остатки.Банк";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Дата", ДатаОперации);
	Запрос.УстановитьПараметр("МатрицаВесовЛиквидности", МатрицаВесовЛиквидности.Выгрузить());
	Запрос.УстановитьПараметр("ГоризонтОперативногоПланирования", ГоризонтОперативногоПланирования);
	Запрос.УстановитьПараметр("ГоризонтТактическогоПланирования", ГоризонтТактическогоПланирования); 
	Запрос.УстановитьПараметр("ПустойБанковскийСчет", 		ДенежныеСредстваВстраиваниеУХКлиентСервер.ПолучитьПустойБанковскийСчет());  
	Запрос.УстановитьПараметр("УчитыватьОвердрафты", 		ЭтотОбъект.ВыводитьОстаткиСУчетомОвердрафтов); 
	Запрос.УстановитьПараметр("ОкончаниеПериодаОтбора", 	ЭтотОбъект.ОкончаниеПериодаОтбора);
	// Установка дополнительного отбора.
	ДополнительныеОтборы = Новый Массив;
	ЭлементыЗаголовкаИзмерение = Новый Массив;
		
	ИмяТипаБанковскиеСчетаОрганизацийДляЗапроса = ДенежныеСредстваВстраиваниеУХКлиентСервер.ИмяТипаБанковскиеСчетаОрганизацийДляЗапроса();
	
	Если ЭтоВнутригрупповоеПеремещение Тогда
		// фильтруем организации
		ДополнительныеОтборы.Добавить("ПредставлениеПлатежногоКалендаря.Организация В (&СписокОрганизацийДляВГО)");
		Запрос.УстановитьПараметр("СписокОрганизацийДляВГО", СписокОрганизацийДляВГО);
		
		// только допустимые счета
		ДополнительныеОтборы.Добавить("НЕ ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса.ЗапретВнутригрупповыхПереводов");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФормулаИзмерение", "ЕСТЬNULL(ВТ_Остатки.Банк, ВТ_Остатки.Организация)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноТекстИтоги", "ВТ_Остатки.Организация");
		
		ДополнительныеОтборы.Добавить("ПредставлениеПлатежногоКалендаря.Валюта = &Валюта");
		Запрос.УстановитьПараметр("Валюта", БанковскийСчетКасса.ВалютаДенежныхСредств);
		
		ЭлементыЗаголовкаИзмерение.Добавить(НСтр("ru = 'Организация'"));
		
	Иначе
		ДополнительныеОтборы.Добавить("ПредставлениеПлатежногоКалендаря.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", БанковскийСчетКасса.Владелец);
		
		// Конвертация валюты может быть только в пределах одной организации
		Если ЭтоКонвертацияВалюты Тогда
			// Отбор только по валюте.
			ДополнительныеОтборы.Добавить("ПредставлениеПлатежногоКалендаря.Валюта <> &Валюта");
			Запрос.УстановитьПараметр("Валюта", БанковскийСчетКасса.ВалютаДенежныхСредств);
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФормулаИзмерение", "ЕСТЬNULL(ВТ_Остатки.Банк, ВТ_Остатки.Валюта)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноТекстИтоги", "ВТ_Остатки.Валюта");
			
			ЭлементыЗаголовкаИзмерение.Добавить(НСтр("ru = 'Валюта'"));
			
		Иначе
			// Валюта та же, счет только другой.
			ДополнительныеОтборы.Добавить("ПредставлениеПлатежногоКалендаря.Валюта = &Валюта");
			Запрос.УстановитьПараметр("Валюта", БанковскийСчетКасса.ВалютаДенежныхСредств);
			
			ДополнительныеОтборы.Добавить("ВЫБОР КОГДА ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса ССЫЛКА "+ИмяТипаБанковскиеСчетаОрганизацийДляЗапроса+"
											|	ТОГДА ВЫРАЗИТЬ(ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса КАК "+ИмяТипаБанковскиеСчетаОрганизацийДляЗапроса+") <> &БанковскийСчетКасса
											|	КОГДА ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса ССЫЛКА Справочник.Кассы
											|	ТОГДА ВЫРАЗИТЬ(ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса КАК Справочник.Кассы) <> &БанковскийСчетКасса
											|КОНЕЦ");
			Запрос.УстановитьПараметр("БанковскийСчетКасса", БанковскийСчетКасса);
				
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФормулаИзмерение", "ВТ_Остатки.Банк");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительноТекстИтоги,", "");
			
		КонецЕсли;
	КонецЕсли;
	
	ЭлементыЗаголовкаИзмерение.Добавить(НСтр("ru = 'Банк'"));
	ЭлементыЗаголовкаИзмерение.Добавить(НСтр("ru = 'Банковский счет'"));
	
	Если ЭтоОперацияСоСчетом Тогда
		ДополнительныеОтборы.Добавить("ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса ССЫЛКА "+ИмяТипаБанковскиеСчетаОрганизацийДляЗапроса);
	Иначе
		ДополнительныеОтборы.Добавить("ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса ССЫЛКА Справочник.Кассы");
	КонецЕсли;
	
	Если ДополнительныеОтборы.Количество() Тогда
		
		ТекстДополнительныхОтборов = СтрСоединить(ДополнительныеОтборы, Символы.ПС + "И ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныйОтбор", ТекстДополнительныхОтборов);
		
	Иначе
		
		Запрос.УстановитьПараметр("ДополнительныйОтбор", Истина);
		
	КонецЕсли;
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(Дерево, "ДоступныеСредства");
	
	Если НЕ ЗначениеЗаполнено(Дерево.Строки) Тогда
		
		Если ЭтоВнутригрупповоеПеремещение Тогда
			ТекстСообщения = НСтр("ru = 'Нет других открытых счетов внутри группы организаций в данной валюте.
				|Запланировать перемещение невозможно.'");
			
		ИначеЕсли ЭтоКонвертацияВалюты Тогда
			ТекстСообщения = НСтр("ru = 'У организации нет открытых счетов в других валютах.
				|Запланировать конвертацию невозможно.'");
			
		Иначе // обычное перемещение внутри организации
			 ТекстСообщения = НСтр("ru = 'У организации нет других открытых счетов в данной валюте.
				|Запланировать перемещение невозможно.'");
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"ДоступныеСредства");
	КонецЕсли;
	
	Если Не ЭтоОперацияСоСчетом Тогда
		ЭлементыЗаголовкаИзмерение.Очистить();
		ЭлементыЗаголовкаИзмерение.Добавить(НСтр("ru = 'Касса'"));
	КонецЕсли;
	
	Элементы.ДоступныеСредстваИзмерение.Заголовок = СтрСоединить(ЭлементыЗаголовкаИзмерение, " / ");
	
КонецПроцедуры   

&НаКлиенте
Процедура ПересчетОстатковПослеОперации()
	
	СтрокаОперации = Неопределено;
	РекурсивноСброситьОстатокПослеОперации(ДоступныеСредства, СтрокаОперации);

	Пока СтрокаОперации <> Неопределено Цикл
		СтрокаОперации.ОстатокПослеОперации = СтрокаОперации.Остаток 
			- ?(ЭтоПополнениеСчетаКассы, 1, -1)*ЭтотОбъект[ИменаРеквизитов.СуммаВедомая];
		СтрокаОперации = СтрокаОперации.ПолучитьРодителя();
	КонецЦикла;
	
	ПересчитатьОстаткиНаСчетахОперации(ЭтотОбъект);	
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуРанееВведенныхРеквизитов()
	
	Если ЭтоКонвертацияВалюты Тогда
		
		Если ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
			
			ВалютаДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчетКонтрагента, "ВалютаДенежныхСредств");
			Если ВалютаДС <> ВалютаСписания Тогда
				БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ГруппаПолучатель.Видимость 	= ЭтоКонвертацияВалюты;   
	Элементы.ГруппаПлатежиПо275ФЗ.Видимость = ОтдельныйСчетГОЗ;
	
КонецПроцедуры

&НаКлиенте
Процедура РекурсивноСброситьОстатокПослеОперации(СтрокаДерева, СтрокаОперации)

	Для Каждого ТекСтрокаДерева Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		Если ТекСтрокаДерева.Измерение = ЭтотОбъект[ИменаРеквизитов.БанковскийСчетКассаВедомый] Тогда
			СтрокаОперации = ТекСтрокаДерева;
		КонецЕсли;
		
		ТекСтрокаДерева.ОстатокПослеОперации = ТекСтрокаДерева.Остаток;
		
		РекурсивноСброситьОстатокПослеОперации(ТекСтрокаДерева, СтрокаОперации);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьВедомыеРеквизитыНаСервере(Знач ИдентификаторСтроки)
	
	Строка = ДоступныеСредства.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ВыбранныйСчет = Строка.Измерение;
	
	ЭтотОбъект[ИменаРеквизитов.БанковскийСчетКассаВедомый] 	= ВыбранныйСчет;
	ЭтотОбъект[ИменаРеквизитов.ВалютаВедомая] 				= ВыбранныйСчет.ВалютаДенежныхСредств;
	ЭтотОбъект[ИменаРеквизитов.ОрганизацияВедомая] 			= ВыбранныйСчет.Владелец;
	
	Если ТипЗнч(ВыбранныйСчет) =  ДенежныеСредстваВстраиваниеУХКлиентСервер.ТипБанковскиеСчетаОрганизаций() Тогда
		ЭтотОбъект[ИменаРеквизитов.БанкВедомый] 			= ВыбранныйСчет.Банк;
	КонецЕсли;
	
	ЭтотОбъект[ИменаРеквизитов.НачальныйОстатокВедомый] = Строка.Остаток;      
	
	Если ЭтоВнутригрупповоеПеремещение И НЕ ЭтоПополнениеСчетаКассы Тогда
		КонтрагентВГО = РаботаСКонтрагентамиУХ.КонтрагентОрганизации(ВыбранныйСчет.Владелец);
	КонецЕсли;
	
	Если ЭтоКонвертацияВалюты Тогда 
		
		//ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект[ИменаРеквизитов.БанковскийСчетКассаВедомый],"ДоговорРасчетноКассовогоОбслуживания");
		Контрагент = РегистрыСведений.СвязьКонтрагентовИБанков.ПолучитьКонтрагентаПоБанку(ЭтотОбъект[ИменаРеквизитов.БанковскийСчетКассаВедомый]);
		
		ДатаПолученияКурса = ТекущаяДатаСеанса();
		КурсВалют = РаботаСКурсамиВалютУХ.ПолучитьКроссКурсВалют(
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаЗачисления, ДатаПолученияКурса), 
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаСписания, ДатаПолученияКурса));
		КурсКонвертации = КурсВалют.Курс;
		КратностьКонвертации = КурсВалют.Кратность;
		Если ЭтоПополнениеСчетаКассы Тогда
			СуммаСписания = СуммаЗачисления * КурсКонвертации / КратностьКонвертации;
		Иначе
			СуммаЗачисления = СуммаСписания * КратностьКонвертации / КурсКонвертации;
		КонецЕсли;
	КонецЕсли;                  
	
	ЗаполнитьОтдельныйСчетГОЗ();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИменаРеквизитов(ЭтоКонвертацияВалюты, ЭтоПополнениеСчетаКассы, ЭтоВнутригрупповоеПеремещение)
	
	ИменаРеквизитов = Новый Структура;
	
	ИменаРеквизитов.Вставить("БанковскийСчетКассаВедущий", ?(ЭтоПополнениеСчетаКассы, "БанковскийСчетКассаЗачисления", "БанковскийСчетКассаСписания"));
	ИменаРеквизитов.Вставить("БанковскийСчетКассаВедомый", ?(ЭтоПополнениеСчетаКассы, "БанковскийСчетКассаСписания", "БанковскийСчетКассаЗачисления"));
	
	ИменаРеквизитов.Вставить("БанкВедущий", ?(ЭтоПополнениеСчетаКассы, "БанкЗачисления", "БанкСписания"));
	ИменаРеквизитов.Вставить("БанкВедомый", ?(ЭтоПополнениеСчетаКассы, "БанкСписания", "БанкЗачисления"));
	
	ИменаРеквизитов.Вставить("НачальныйОстатокВедущий", ?(ЭтоПополнениеСчетаКассы, "НачальныйОстатокНаСчетеКассеЗачисления", "НачальныйОстатокНаСчетеКассеСписания"));
	ИменаРеквизитов.Вставить("НачальныйОстатокВедомый", ?(ЭтоПополнениеСчетаКассы, "НачальныйОстатокНаСчетеКассеСписания", "НачальныйОстатокНаСчетеКассеЗачисления"));
	
	ИменаРеквизитов.Вставить("ОстатокВедущий", ?(ЭтоПополнениеСчетаКассы, "ОстатокНаСчетеКассеЗачисления", "ОстатокНаСчетеКассеСписания"));
	ИменаРеквизитов.Вставить("ОстатокВедомый", ?(ЭтоПополнениеСчетаКассы, "ОстатокНаСчетеКассеСписания", "ОстатокНаСчетеКассеЗачисления"));
	
	ИменаРеквизитов.Вставить("СуммаВедущая", ?(ЭтоКонвертацияВалюты И ЭтоПополнениеСчетаКассы, "СуммаЗачисления", "СуммаСписания"));
	ИменаРеквизитов.Вставить("СуммаВедомая", ?(ЭтоКонвертацияВалюты И ЭтоПополнениеСчетаКассы, "СуммаСписания", "СуммаЗачисления"));
	
	ИменаРеквизитов.Вставить("ДатаВедущая", ?(ЭтоКонвертацияВалюты И ЭтоПополнениеСчетаКассы, "ДатаЗачисления", "ДатаСписания"));
	ИменаРеквизитов.Вставить("ДатаВедомая", ?(ЭтоКонвертацияВалюты И ЭтоПополнениеСчетаКассы, "ДатаСписания", "ДатаЗачисления"));
	
	ИменаРеквизитов.Вставить("ВалютаВедущая", ?(ЭтоКонвертацияВалюты И ЭтоПополнениеСчетаКассы, "ВалютаЗачисления", "ВалютаСписания"));
	ИменаРеквизитов.Вставить("ВалютаВедомая", ?(ЭтоКонвертацияВалюты И ЭтоПополнениеСчетаКассы, "ВалютаСписания", "ВалютаЗачисления"));
	
	ИменаРеквизитов.Вставить("ОрганизацияВедущая", ?(ЭтоВнутригрупповоеПеремещение И ЭтоПополнениеСчетаКассы, "ОрганизацияЗачисления", "ОрганизацияСписания"));
	ИменаРеквизитов.Вставить("ОрганизацияВедомая", ?(ЭтоВнутригрупповоеПеремещение И ЭтоПополнениеСчетаКассы, "ОрганизацияСписания", "ОрганизацияЗачисления"));
	
	Возврат ИменаРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииКурсаКратности()
	
	Если КурсКонвертации = 0 Тогда
		КурсКонвертации = 1;
	КонецЕсли;
	
	Если КратностьКонвертации = 0 Тогда
		КратностьКонвертации = 1;
	КонецЕсли;
	
	Если ЭтоПополнениеСчетаКассы Тогда
		СуммаСписания = СуммаЗачисления * КурсКонвертации / КратностьКонвертации;
	Иначе
		СуммаЗачисления = СуммаСписания * КратностьКонвертации / КурсКонвертации;
	КонецЕсли;
	
	ПересчетОстатковПослеОперации();
	
КонецПроцедуры

&НаСервере
Функция КомандаОКНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// 1. Добавление информации об инструменте.
	Инструмент = Отчеты.ПлатежныйКалендарьУХ.СтруктураИнструмента();
	Инструмент.Активна = Истина;
	Инструмент.ИдентификаторОперации = Новый УникальныйИдентификатор;
	Если ЭтоКонвертацияВалюты Тогда
		ВидОперации = Перечисления.ВидыОперацийПлатежногоКалендаря.КонвертацияВалюты;
	ИначеЕсли ЭтоВнутригрупповоеПеремещение Тогда
		ВидОперации = Перечисления.ВидыОперацийПлатежногоКалендаря.ВнутригрупповоеПеремещение;
	Иначе
		ВидОперации = Перечисления.ВидыОперацийПлатежногоКалендаря.ПереводСобственныхСредств;
	КонецЕсли;
	Инструмент.ВидОперации = ВидОперации;
	
	Если РедактированиеТекущейОперации Тогда
		Инструмент.Активна = ДанныеТекущейОперации.Активна;
	КонецЕсли;
	
	Инструмент.УточнениеОперации = СтруктураДеталейОперации();
	Инструмент.ПредставлениеОперации = ПредставлениеОперации();
	
	// 1. Добавление строк операций.
	// 1.1 Списание	
	ДанныеБанковскогоСчетаКассы = Отчеты.ПлатежныйКалендарьУХ.ПолучитьДанныеБанковскогоСчетаКассы(БанковскийСчетКассаСписания);
	
	МЗ = РегистрыСведений.ПредставлениеПлатежногоКалендаря.СоздатьМенеджерЗаписи();
	МЗ.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	МЗ.Активна = Инструмент.Активна;
	МЗ.Инструмент = Инструмент.ВидОперации;
	
	ЗаполнитьЗначенияСвойств(МЗ,ДанныеБанковскогоСчетаКассы);
	
	МЗ.Дата = ДатаСписания;
	МЗ.ИдентификаторДобавившейОперации = Инструмент.ИдентификаторОперации;
	МЗ.ИдентификаторЗаписи = Новый УникальныйИдентификатор;
	МЗ.РазделПлатежногоКалендаря = Перечисления.РазделыПлатежногоКалендаря.СписаниеСредств;
	МЗ.Сумма = -СуммаСписания;    
	МЗ.Оптимизация	= Истина;
	МЗ.Записать();
	
	// 1.2 Зачисление     
	ДанныеБанковскогоСчетаКассы = Отчеты.ПлатежныйКалендарьУХ.ПолучитьДанныеБанковскогоСчетаКассы(БанковскийСчетКассаЗачисления);
	
	МЗ = РегистрыСведений.ПредставлениеПлатежногоКалендаря.СоздатьМенеджерЗаписи();
	МЗ.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	МЗ.Активна = Инструмент.Активна;
	МЗ.Инструмент = Инструмент.ВидОперации;
	
	ЗаполнитьЗначенияСвойств(МЗ,ДанныеБанковскогоСчетаКассы);
	
	МЗ.Дата = ДатаЗачисления;
	МЗ.ИдентификаторДобавившейОперации = Инструмент.ИдентификаторОперации;
	МЗ.ИдентификаторЗаписи = Новый УникальныйИдентификатор;
	МЗ.РазделПлатежногоКалендаря = Перечисления.РазделыПлатежногоКалендаря.ПоступлениеСредств;
	МЗ.Сумма = СуммаЗачисления;
	МЗ.Оптимизация	= Истина;

	МЗ.Записать();
	
	Возврат Инструмент;
	
КонецФункции

&НаСервере
Функция СтруктураДеталейОперации()
	
	СтрокаРеквизитов =
		"БанкСписания, БанкЗачисления, БанковскийСчетКассаСписания, БанковскийСчетКассаЗачисления, ДатаСписания, СуммаСписания,
		|ЭтоПополнениеСчетаКассы, СуммаЗачисления, ДатаЗачисления, КурсКонвертации, КратностьКонвертации,
		|ВалютаСписания, ВалютаЗачисления, ОрганизацияСписания, ОрганизацияЗачисления, ДоговорКонтрагента,
		|ВидОперацииУХ, ВидОперацииУХВстречный, ЦФО, Проект, Подразделение,
		|СтатьяДвиженияДенежныхСредств, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6,
		|СтатьяДвиженияДенежныхСредствЗачисление, АналитикаЗачисления1, АналитикаЗачисления2, АналитикаЗачисления3,
		|АналитикаЗачисления4, АналитикаЗачисления5, АналитикаЗачисления6,
		|ПлатежиПо275ФЗ, ТипПлатежаФЗ275, ДоговорСЗаказчиком, Контрагент, БанковскийСчетКонтрагента,ВидДенежныхСредств,ГоризонтОперативногоПланирования,ГоризонтТактическогоПланирования";

	Результат = Новый Структура(СтрокаРеквизитов);
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	Если ТипЗнч(Результат.БанковскийСчетКассаСписания) = ДенежныеСредстваВстраиваниеУХКлиентСервер.ТипБанковскиеСчетаОрганизаций() Тогда
		Результат.БанкСписания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.БанковскийСчетКассаСписания, "Банк");
	КонецЕсли;
	
	Если ТипЗнч(Результат.БанковскийСчетКассаЗачисления) = ДенежныеСредстваВстраиваниеУХКлиентСервер.ТипБанковскиеСчетаОрганизаций() Тогда
		Результат.БанкЗачисления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.БанковскийСчетКассаЗачисления, "Банк");
	КонецЕсли;
	
	Если ЭтоВнутригрупповоеПеремещение Тогда
		
		Результат.Контрагент = ЭтотОбъект.КонтрагентВГО;
		Результат.БанковскийСчетКонтрагента = УправлениеДенежнымиСредствамиУХ.БанковскийСчетКонтрагента(
			Результат.БанковскийСчетКассаЗачисления);
			
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПредставлениеОперации()
	
	ЭтоСписаниеСоСчета = ВариантСписания = "СоСчета";
	ЭтоЗачислениеНаСчет = ВариантЗачисления = "НаСчет";
	
	ФорматнаяСтрокаДаты = "ДЛФ=D";
	
	Если ЭтоКонвертацияВалюты Тогда
		
		Возврат СтрШаблон(НСтр("ru = 'Конвертация валюты: списание %1 %2 со счета %3 в дату %4, зачисление %5 %6 на счет %7 в дату %8 (%9)'"),
							СуммаСписания,
							ВалютаСписания,
							БанковскийСчетКассаСписания,
							Формат(ДатаСписания, ФорматнаяСтрокаДаты),
							СуммаЗачисления,
							ВалютаЗачисления,
							БанковскийСчетКассаЗачисления,
							Формат(ДатаЗачисления, ФорматнаяСтрокаДаты),
							ОрганизацияСписания);
			
	ИначеЕсли ЭтоВнутригрупповоеПеремещение Тогда
			
		Возврат СтрШаблон(НСтр("ru = 'Перевод %1 %2 со счета %3 организации %6 на счет %4 организации %7 в дату %5'"),
							СуммаСписания,
							ВалютаСписания,
							БанковскийСчетКассаСписания,
							БанковскийСчетКассаЗачисления,
							Формат(ДатаСписания, ФорматнаяСтрокаДаты),
							ОрганизацияСписания,
							ОрганизацияЗачисления);
	Иначе
			
		Возврат СтрШаблон(НСтр("ru = 'Перевод %1 %2 %3 %4 %5 %6 в дату %7 (%8)'"),
							СуммаСписания,
							ВалютаСписания,
							?(ЭтоСписаниеСоСчета,НСтр("ru = 'со счета'"),НСтр ("ru = 'из кассы'")),
							БанковскийСчетКассаСписания,
							?(ЭтоЗачислениеНаСчет,НСтр("ru = 'на счет'"),НСтр("ru = 'в кассу'")),
							БанковскийСчетКассаЗачисления,
							Формат(ДатаСписания, ФорматнаяСтрокаДаты),
							ОрганизацияСписания);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	// Подсветка выбранного счета
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ДоступныеСредстваИзмерение.Имя);
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ДоступныеСредстваОстаток.Имя);
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ДоступныеСредстваОстатокПослеОперации.Имя);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДоступныеСредства.Измерение", 
		ВидСравненияКомпоновкиДанных.Равно,
		Новый ПолеКомпоновкиДанных(ИменаРеквизитов.БанковскийСчетКассаВедомый),,Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ФонУправляющегоПоля);

	// Подсветка группировочных строк
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ДоступныеСредстваИзмерение.Имя);
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ДоступныеСредстваОстаток.Имя);
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ДоступныеСредстваОстатокПослеОперации.Имя);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДоступныеСредства.ЭтоДетальнаяЗапись", 
		ВидСравненияКомпоновкиДанных.Равно,
		Ложь,,Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.НедоступныеДанныеУХЦвет);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьОстаткиНаСчетахОперации(Форма)
	Форма.ОстатокНаСчетеКассеСписания = Форма.НачальныйОстатокНаСчетеКассеСписания - Форма.СуммаСписания;
	Форма.ОстатокНаСчетеКассеЗачисления = Форма.НачальныйОстатокНаСчетеКассеЗачисления + Форма.СуммаЗачисления;	
КонецПроцедуры

&НаСервере
Процедура СоздатьАналитикиСтатейБюджета()
	
	// Статьи бюджетов
	АСБ = АналитикиСтатейБюджетовУХ;
	МассивОписанийСтатей = Новый Массив;
	
	// Статья в шапке документа Статья и Аналитика в Объекте (ВидАналитики нельзя создать в реквизите формы Объект. Должны быть созданы реквизиты формы)
	ДанныеАналитикиШапки = АСБ.Новый_АналитикиСтатьиБюджета("Аналитика%1", "", "");
	ПараметрыСтатьиШапки = АСБ.Новый_СтатьяБюджетов("СтатьяДвиженияДенежныхСредств", "", ДанныеАналитикиШапки);
	
	ИмяЭлемента = Элементы.СтатьяДвиженияДенежныхСредств.Имя;
	ИмяРодителя = Элементы.СтатьяДвиженияДенежныхСредств.Родитель.Имя;
	АСБ.СтатьяБюджета_НовыйЭлементФормы(ПараметрыСтатьиШапки, ИмяЭлемента, "", Новый Структура("Родитель, ПередЭлементом",ИмяРодителя, ""));
	АСБ.СтатьяБюджетов_ЭлементыАналитикиИзШаблона(ПараметрыСтатьиШапки, ИмяЭлемента, "Аналитика%1", "", "");
	
	//
	МассивОписанийСтатей.Добавить(ПараметрыСтатьиШапки);
	
	// Статья зачисления в шапке документа
	ДанныеАналитикиШапкиЗачисление = АСБ.Новый_АналитикиСтатьиБюджета("АналитикаЗачисления%1", "", "");
	ПараметрыСтатьиШапкиЗачисление = АСБ.Новый_СтатьяБюджетов("СтатьяДвиженияДенежныхСредствЗачисление", "", ДанныеАналитикиШапкиЗачисление);
	
	ИмяЭлемента = Элементы.СтатьяДвиженияДенежныхСредствЗачисление.Имя;
	ИмяРодителя = Элементы.СтатьяДвиженияДенежныхСредствЗачисление.Родитель.Имя;
	АСБ.СтатьяБюджета_НовыйЭлементФормы(ПараметрыСтатьиШапкиЗачисление, ИмяЭлемента, "", Новый Структура("Родитель, ПередЭлементом",ИмяРодителя, ""));
	АСБ.СтатьяБюджетов_ЭлементыАналитикиИзШаблона(ПараметрыСтатьиШапкиЗачисление, ИмяЭлемента, "АналитикаЗачисления%1", "", "");
	
	//
	МассивОписанийСтатей.Добавить(ПараметрыСтатьиШапкиЗачисление);
	
	// Создать элементы формы для статей бюджетов и их аналитик
	ПараметрыЭлементов = ФормыУХ.ПолучитьПараметрыЭлементовПоУмолчанию();
	АналитикиСтатейБюджетовУХ.СоздатьСтатьиБюджетовИАналитики(ЭтаФорма, МассивОписанийСтатей, ПараметрыЭлементов.ПолеВвода);
	
КонецПроцедуры

&НаСервере
Функция ОстатокПоСчетуНаДату(БанковскийСчетКасса, Дата)
	
	Остаток = 0;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СУММА(ПредставлениеПлатежногоКалендаря.Сумма) КАК Сумма
	|ИЗ
	|	РегистрСведений.ПредставлениеПлатежногоКалендаря КАК ПредставлениеПлатежногоКалендаря
	|ГДЕ
	|	ПредставлениеПлатежногоКалендаря.ВерсияПлатежногоКалендаря = &ВерсияПлатежногоКалендаря
	|	И ПредставлениеПлатежногоКалендаря.Пользователь = &Пользователь
	|	И ПредставлениеПлатежногоКалендаря.Активна
	|	И ПредставлениеПлатежногоКалендаря.БанковскийСчетКасса = &БанковскийСчетКасса
	|	И ПредставлениеПлатежногоКалендаря.Дата <= &Дата"
	);
	Запрос.УстановитьПараметр("ВерсияПлатежногоКалендаря", Справочники.СохраненныеВерсииПлатежногоКалендаря.ПустаяСсылка());
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("БанковскийСчетКасса", БанковскийСчетКасса);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Остаток = Выборка.Сумма;
	КонецЕсли;
	
	Возврат Остаток;
	
КонецФункции

&НаКлиенте
Процедура УстановитьСтраницыПомощника(ИмяСтраницы)

	УправлениеКнопкамиПомощника(ИмяСтраницы);
	Элементы.Помощник.ТекущаяСтраница = Элементы[ИмяСтраницы];
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеКнопкамиПомощника(ИмяСтраницы)
	
	ПараметрыСтраницы = ПараметрыСтраницы(ИмяСтраницы);
	
	КнопкаНазад = Элементы.Назад;
	КнопкаДалее = Элементы.Далее;
	КнопкаОК = Элементы.ФормаКомандаОК;
	
	КнопкаДалее.Доступность = ПараметрыСтраницы.Следующие.Количество() > 0;
	КнопкаДалее.КнопкаПоУмолчанию = ПараметрыСтраницы.Следующие.Количество() > 0;
	
	КнопкаОК.Доступность = ПараметрыСтраницы.Следующие.Количество() = 0 ИЛИ ПараметрыСтраницы.ДоступностьОК;
	КнопкаОК.КнопкаПоУмолчанию = ПараметрыСтраницы.Следующие.Количество() = 0 ИЛИ ПараметрыСтраницы.ДоступностьОК;
	
	КнопкаНазад.Доступность = ПараметрыСтраницы.Предыдущие.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ТекстШаблона = НСтр("ru = '%1: %2 (%3)'");
	Заголовок = СтрШаблон(ТекстШаблона, Строка(БанковскийСчетКасса.Владелец), СтрВидОперации, Элементы.Помощник.ТекущаяСтраница.Заголовок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАналитикиБюджетирования()
	
	Если НЕ ЭтоКонвертацияВалюты И НЕ ЭтоВнутригрупповоеПеремещение Тогда
		// просто перемещение
		ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПереводНаДругойСчетОрганизации;
		
		Если ЗначениеЗаполнено(БанковскийСчетКассаСписания) И ЗначениеЗаполнено(БанковскийСчетКассаЗачисления) Тогда
			
			Если ВариантСписания = "ИзКассы" И ВариантЗачисления = "НаСчет" Тогда
				ВидОперацииУХ = Справочники.ВидыОперацийУХ.Инкассация;	
			ИначеЕсли ВариантСписания = "СоСчета" И ВариантЗачисления = "ВКассу" Тогда
				ВидОперацииУХ = Справочники.ВидыОперацийУХ.СнятиеНаличныхВКассу;
			ИначеЕсли ВариантСписания = "СоСчета" И ВариантЗачисления = "НаСчет" Тогда
				ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПереводНаДругойСчетОрганизации;
			ИначеЕсли ВариантСписания = "ИзКассы" И ВариантЗачисления = "ВКассу" Тогда
				ВидОперацииУХ = Справочники.ВидыОперацийУХ.ВыдачаДенежныхСредствВДругуюКассу;
			КонецЕсли;

		КонецЕсли;
		
		ВидОперацииУХВстречный = ВидыОперацийУХВызовСервераПовтИсп.ВстречныйВидОперацииУХ(ВидОперацииУХ);
		
	ИначеЕсли ЭтоКонвертацияВалюты И НЕ ЭтоВнутригрупповоеПеремещение Тогда
		// конвертация
		Если ЭтоПополнениеСчетаКассы Тогда
			ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПриобретениеВалюты;
		Иначе
			ВидОперацииУХ = Справочники.ВидыОперацийУХ.ПродажаВалюты;
		КонецЕсли;
		ВидОперацииУХВстречный = ВидыОперацийУХВызовСервераПовтИсп.ВстречныйВидОперацииУХ(ВидОперацииУХ);
		
	ИначеЕсли НЕ ЭтоКонвертацияВалюты И ЭтоВнутригрупповоеПеремещение Тогда
		// Внутригрупповое перемещение
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда
		СтатьяДвиженияДенежныхСредств = ВидыОперацийУХВызовСервераПовтИсп.ОсновнаяСтатьяБюджетаПоВидуОперации(ВидОперацииУХ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредствЗачисление) Тогда
		СтатьяДвиженияДенежныхСредствЗачисление = ВидыОперацийУХВызовСервераПовтИсп.ОсновнаяСтатьяБюджетаПоВидуОперации(ВидОперацииУХВстречный);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтдельныйСчетГОЗ()

	Если ВариантСписания = "ИзКассы"
		ИЛИ НЕ ЗначениеЗаполнено(БанковскийСчетКассаСписания) Тогда 
		ОтдельныйСчетГОЗ = Ложь;
		Возврат;
	КонецЕсли;	
	
	ОтдельныйСчетГОЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчетКассаСписания, "ОтдельныйСчетГОЗ");
	
КонецПроцедуры	

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Подразделение");
	СтруктураРеквизитов.Вставить("ЦФО", "ОсновнойЦФО");
	СтруктураРеквизитов.Вставить("Проект", "ОсновнойПроект");
		
	Если ТипЗнч(ДоговорКонтрагента.ВерсияСоглашения)= Тип("ДокументСсылка.ВерсияСоглашенияКоммерческийДоговор") Тогда
		СтруктураРеквизитов.Вставить("СтатьяДвиженияДенежныхСредств", "СтатьяДвиженияДенежныхСредств");
	КонецЕсли;                                                                                                              
	
	РеквизитыДоговорКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента.ВерсияСоглашения,СтруктураРеквизитов);      

	ЗаполнитьЗначенияСвойств(ЭтаФорма,РеквизитыДоговорКонтрагента);
		
КонецПроцедуры

#КонецОбласти
